=================
Single Element in Dynamic
=================
test

    {a}
---

(method
    (unary_selector (identifier))
    (statement
            (dynamic_array (identifier))))


=================
Multiple Elements in Dynamic
=================
test

    {a. b. c}
---

(method
    (unary_selector (identifier))
    (statement
            (dynamic_array (identifier) (identifier) (identifier))))


=================
Multiple Elements in Dynamic with trailing dot
=================
test

    {a. b. c.}
---

(method
    (unary_selector (identifier))
    (statement
            (dynamic_array (identifier) (identifier) (identifier))))


=================
Multiple Elements in Byte Array
=================
test

    #[2 5 6]
---

(method
    (unary_selector (identifier))
    (statement
            (byte_array (number) (number) (number))))

