=================
Identifier capitalized
=================
test

    SBWatch2
---

(method
    (unary_selector (identifier))
    (statement
        (identifier)))

=================
Identifier
=================
test

    abc123
---

(method
    (unary_selector (identifier))
    (statement
        (identifier)))

=================
String
=================
test

    'abc'
---

(method
    (unary_selector (identifier))
    (statement
        (string)))

=================
Empty String
=================
test

    ''
---

(method
    (unary_selector (identifier))
    (statement
        (string)))

=================
Number
=================
test

    123
---

(method
    (unary_selector (identifier))
    (statement
        (number)))

=================
Number with Base
=================
test

    12r123
---

(method
    (unary_selector (identifier))
    (statement
        (number)))

=================
Number with Decimal
=================
test

    2.3.
    2.4
---

(method
    (unary_selector (identifier))
    (statement (number))
    (statement (number)))

=================
Symbol
=================
test

    #abc123
---

(method
    (unary_selector (identifier))
    (statement
        (symbol)))

=================
Binary Symbol
=================
test

    #++-
---

(method
    (unary_selector (identifier))
    (statement
        (symbol)))


=================
Quoted Symbol
=================
test

    #'abc123'
---

(method
    (unary_selector (identifier))
    (statement
        (symbol)))


=================
Empty Symbol
=================
test

    #''
---

(method
    (unary_selector (identifier))
    (statement
        (symbol)))


=================
Character
=================
test

    $a
---

(method
    (unary_selector (identifier))
    (statement
        (character)))

=================
Space Character
=================
test

    $ 
---

(method
    (unary_selector (identifier))
    (statement
        (character)))

=================
Dollar Character
=================
test

    $$
---

(method
    (unary_selector (identifier))
    (statement
        (character)))

=================
Return Character
=================
test

    $

---

(method
    (unary_selector (identifier))
    (statement
        (character)))

